InformationRegisters/СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеРеквизитовНаРусскомИГосударственномЯзыках</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаРусскомЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаГосЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаименованиеОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазваниеНаселенногоПункта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СоответствиеРеквизитовНаРусскомИГосударственномЯзыках/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	ТабличныйДокумент.Вывести(РегистрыСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.ПолучитьМакет("ШаблонФормыВвода"));
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Запись.Период) Тогда
		Запись.Период = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Организация) Тогда
		ВосстановитьДанныеВТабличномДокументе();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РеквизитОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Реквизит) Тогда
		// Это новый. Заполняем макет пустыми значениями
		ЗаполнитьТЧ(ВыбранноеЗначение);
		
	ИначеЕсли Запись.Реквизит <> ВыбранноеЗначение Тогда
		
		// Макет уже заполнен. Проверяем, есть ли данные, которые нужно сохранить
		
		ВыбранныйРеквизит = ПроверитьРеквизит(Запись.Реквизит);
		
		Если ВыбранныйРеквизит = "Наименование" Тогда
			
			ПроверяемоеПоле_Гос = ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Значение;
			ПроверяемоеПоле_Рус = ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Значение;
			
		ИначеЕсли ВыбранныйРеквизит = "ФормаСобственности" Тогда
			
			ПроверяемоеПоле_Гос = ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Значение;
			ПроверяемоеПоле_Рус = ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Значение;
			
		ИначеЕсли ВыбранныйРеквизит = "МестоРегистрации" Тогда
			
			ПроверяемоеПоле_Гос = ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Значение;
			ПроверяемоеПоле_Рус = ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Значение;
			
		КонецЕсли;
		
		// Если в полях есть значние, отличное от стандартного, сообщаем пользователю
		Если (ЗначениеЗаполнено(ПроверяемоеПоле_Гос) И ПроверяемоеПоле_Гос <> "ВВЕДИТЕ ЗНАЧЕНИЕ") Или 
			(ЗначениеЗаполнено(ПроверяемоеПоле_Рус) И ПроверяемоеПоле_Рус <> "ВВЕДИТЕ ЗНАЧЕНИЕ") Тогда
			
			МассивЗначений = Новый Массив();
			МассивЗначений.Добавить(Запись.Реквизит);
			МассивЗначений.Добавить(ВыбранноеЗначение);
			
			СпроситьПользователяОбОчисткеДанных(МассивЗначений)
			
		Иначе
			// Поля заполнены стандартными значениями или пустые - перезаполняем без потерь
			ЗаполнитьТЧ(ВыбранноеЗначение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть()
	
	Если Не Модифицированность Тогда
		
		Закрыть();
		
	Иначе	
		// Определяем, какие поля макета должны быть заполнены - это зависит от реквизита.
		
		Если ПроверитьЗаполнениеСервер() Тогда
			
			ВыбранныйРеквизит = ПроверитьРеквизит(Запись.Реквизит);
			
			Если ВыбранныйРеквизит = "Наименование" Тогда
				
				ПроверяемоеПоле_Гос = ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Значение;
				ПроверяемоеПоле_Рус = ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Значение;
				
			ИначеЕсли ВыбранныйРеквизит = "ФормаСобственности" Тогда
				
				ПроверяемоеПоле_Гос = ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Значение;
				ПроверяемоеПоле_Рус = ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Значение;
				
			ИначеЕсли ВыбранныйРеквизит = "МестоРегистрации" Тогда
				
				ПроверяемоеПоле_Гос = ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Значение;
				ПроверяемоеПоле_Рус = ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Значение;
				
			КонецЕсли;
			
			// Если осталось стандартное значение или пустое поле, нужно сообщить об этом
			Если ПроверяемоеПоле_Гос = "ВВЕДИТЕ ЗНАЧЕНИЕ" Или ПроверяемоеПоле_Рус = "ВВЕДИТЕ ЗНАЧЕНИЕ" Или
				Не ЗначениеЗаполнено(ПроверяемоеПоле_Гос) Или Не ЗначениеЗаполнено(ПроверяемоеПоле_Рус) Тогда
				
				ПустыеЗначения = Новый Массив();
				ПустыеЗначения.Добавить(ПроверяемоеПоле_Гос);
				ПустыеЗначения.Добавить(ПроверяемоеПоле_Рус);
				
				СообщитьПользователюОПустыхЗначенияхНаКлиенте(ПустыеЗначения);
				
			Иначе
				
				Записать();
				Закрыть();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НаименованиеОрганизации Тогда
		
		// Восстанавливаем исходное состояние формы
		УстановитьУсловноеОформление();
		
		// Включаем возможность ввода
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Защита = Ложь;
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Защита = Ложь;
		
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		
		// Указываем на ячейку для заполнения
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Значение = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Значение = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		
		Запись.НаГосЯзыке =	"ВВЕДИТЕ ЗНАЧЕНИЕ";
		Запись.НаРусскомЯзыке = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		
	ИначеЕсли ВыбранноеЗначение = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.ФормаСобственности Тогда 
		
		// Восстанавливаем исходное состояние формы
		УстановитьУсловноеОформление();
		
		// Включаем возможность ввода
		ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Защита = Ложь;
		ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Защита = Ложь;
		
		ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		
		// Указываем на ячейку для заполнения
		ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Значение = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Значение = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		
		Запись.НаГосЯзыке =	"ВВЕДИТЕ ЗНАЧЕНИЕ";
		Запись.НаРусскомЯзыке = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		
	ИначеЕсли ВыбранноеЗначение = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НазваниеНаселенногоПункта Тогда
		
		// Восстанавливаем исходное состояние формы
		УстановитьУсловноеОформление();
		
		// Включаем возможность ввода
		ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Защита = Ложь;
		ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Защита = Ложь;
		
		ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		
		// Указываем на ячейку для заполнения
		ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Значение = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Значение = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		
		Запись.НаГосЯзыке =	"ВВЕДИТЕ ЗНАЧЕНИЕ";
		Запись.НаРусскомЯзыке = "ВВЕДИТЕ ЗНАЧЕНИЕ";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТабличныйДокументПриИзмененииСодержимогоОбластиНаСервере()
	
	ЗначениеНаГосЯзыке = "";
	ЗначениеНаРусЯзыке = "";
	
	Если Запись.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НаименованиеОрганизации Тогда
		
		ЗначениеНаГосЯзыке = ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Значение;
		ЗначениеНаРусЯзыке = ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Значение;
		
	ИначеЕсли Запись.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.ФормаСобственности Тогда
		
		ЗначениеНаГосЯзыке = ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Значение;
		ЗначениеНаРусЯзыке = ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Значение;
		
	ИначеЕсли Запись.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НазваниеНаселенногоПункта Тогда
		
		ЗначениеНаГосЯзыке = ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Значение;
		ЗначениеНаРусЯзыке = ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Значение;
		
	КонецЕсли;
	
	Запись.НаГосЯзыке = ЗначениеНаГосЯзыке;
	Запись.НаРусскомЯзыке = ЗначениеНаРусЯзыке;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	ТабличныйДокументПриИзмененииСодержимогоОбластиНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьРеквизит(ВыбранныйРеквизит) Экспорт
	
	Если ВыбранныйРеквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НаименованиеОрганизации Тогда
		
		Значение = "Наименование";
		
	ИначеЕсли ВыбранныйРеквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.ФормаСобственности Тогда
		
		Значение = "ФормаСобственности";
		
	ИначеЕсли ВыбранныйРеквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НазваниеНаселенногоПункта Тогда
		
		Значение = "МестоРегистрации";
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Защита = Истина;
	ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Защита = Истина;
	ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Защита 	   = Истина;
	ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Защита	   = Истина;
	ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Защита 		   = Истина;
	ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Защита 		   = Истина;
	
	ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.ЦветТекста = Новый Цвет(0, 0, 0);
	ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.ЦветТекста = Новый Цвет(0, 0, 0);
	ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.ЦветТекста 	   = Новый Цвет(0, 0, 0);
	ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.ЦветТекста 	   = Новый Цвет(0, 0, 0);
	ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.ЦветТекста 		   = Новый Цвет(0, 0, 0);
	ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.ЦветТекста 		   = Новый Цвет(0, 0, 0);
	
	СтандартныеНаименования = ФормированиеПечатныхФормПоПравиламВеденияДО.ПолучитьСтандартныеНаименованияДляМакета();
	
	ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Значение = СтандартныеНаименования.НаименованиеОрганизации_Гос;
	ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Значение = СтандартныеНаименования.НаименованиеОрганизации_Рус;
	ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Значение 	 = СтандартныеНаименования.ФормаСобственности_Гос;
	ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Значение	  	 = СтандартныеНаименования.ФормаСобственности_Рус;
	ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Значение 			 = СтандартныеНаименования.МестоИздания_Гос;
	ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Значение 			 = СтандартныеНаименования.МестоИздания_Рус;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьДанныеВТабличномДокументе()
	
	Если Запись.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НаименованиеОрганизации Тогда
		
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Значение = Запись.НаГосЯзыке;
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Значение = Запись.НаРусскомЯзыке;
		
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.Защита = Ложь;
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.Защита = Ложь;
		
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаГосЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		ТабличныйДокумент.Области.НаименованиеОрганизацииНаРусЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		
	ИначеЕсли Запись.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.ФормаСобственности Тогда
		
		ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Значение = Запись.НаГосЯзыке;
		ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Значение = Запись.НаРусскомЯзыке;
		
		ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.Защита = Ложь;
		ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.Защита = Ложь;
		
		ТабличныйДокумент.Области.ФормаСобственностиНаГосЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		ТабличныйДокумент.Области.ФормаСобственностиНаРусЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		
	ИначеЕсли Запись.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НазваниеНаселенногоПункта Тогда
		
		ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Значение = Запись.НаГосЯзыке;
		ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Значение = Запись.НаРусскомЯзыке;
		
		ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.Защита = Ложь;
		ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.Защита = Ложь;
		
		ТабличныйДокумент.Области.МестоИзданияНаГосЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		ТабличныйДокумент.Области.МестоИзданияНаРусЯзыке.ЦветТекста = Новый Цвет(255, 0, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователюОПустыхЗначенияхНаКлиенте(ПустыеЗначения)
	
	Оповещение = Новый ОписаниеОповещения("СообщитьПользователюОПустыхЗначенияхНаКлиентеЗавершение", ЭтотОбъект, ПустыеЗначения);	
	
	ТекстВопроса = НСтр("ru = 'В макете шапки остались не заполненные поля, соответствующие выбранному реквизиту.  
	|Продолжить и записать пустые значения?'");
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		НСтр("ru = 'Да'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки,  , КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователюОПустыхЗначенияхНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПроверяемоеПоле_Гос = ДополнительныеПараметры[0]; 
		ПроверяемоеПоле_Рус = ДополнительныеПараметры[1]; 
		
		Если Не ЗначениеЗаполнено(ПроверяемоеПоле_Гос) Или ПроверяемоеПоле_Гос = "ВВЕДИТЕ ЗНАЧЕНИЕ" Тогда
			
			ПроверяемоеПоле_Гос = "";
			Запись.НаГосЯзыке = "";
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПроверяемоеПоле_Рус) Или ПроверяемоеПоле_Рус = "ВВЕДИТЕ ЗНАЧЕНИЕ" Тогда
			
			ПроверяемоеПоле_Рус = "";
			Запись.НаРусскомЯзыке = "";
			
		КонецЕсли;
		
		Записать();
		Модифицированность = Ложь;
		Закрыть();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьПользователяОбОчисткеДанных(МассивЗначений)
	
	Оповещение = Новый ОписаниеОповещения("СпроситьПользователяОбОчисткеДанныхЗавершение", ЭтотОбъект, МассивЗначений);	
	
	ТекстВопроса = НСтр("ru = 'В макете шапки есть заполненные поля. При изменении реквизита, эти данные будут утеряны. 
	|Изменить реквизит?'");
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		НСтр("ru = 'Да'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки,  , КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьПользователяОбОчисткеДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		// Обнуляем данные, заполняем стандартные значения полей
		ЗаполнитьТЧ(ДополнительныеПараметры[1]);
		
	Иначе
		
		// Восстанавливаем значение поеля Реквизит, оставляем макет без изменения
		Запись.Реквизит = ДополнительныеПараметры[0];
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеСервер()
	Возврат ПроверитьЗаполнение();
КонецФункции

#КонецОбласти
